In [1]:
import pandas as pd

In [7]:
data = {
    'Name':['Jean','Maria','Teddy'],
    'Age':[20,25,18],
    'Location':['La Paz','La Paz','Santa Cruz']
}
data_pandas = pd.DataFrame(data)
data_pandas

    Name  Age    Location
0   Jean   20      La Paz
1  Maria   25      La Paz
2  Teddy   18  Santa Cruz

In [8]:
#menores de 20
data_pandas[data_pandas.Age < 20]

    Name  Age    Location
2  Teddy   18  Santa Cruz

In [9]:
# from la paz
data_pandas[data_pandas.Location == 'La Paz']

    Name  Age Location
0   Jean   20   La Paz
1  Maria   25   La Paz